
Функция papiany(ЗапросHTTP)
	
	Если ВРег(ЗапросHTTP.HTTPМетод) = ВРег("GET") Тогда 
		Ответ = Новый HTTPСервисОтвет(200);
		Ответ.Заголовки.Вставить("Content-Type","text/html; charset=utf-8");
		Ответ.УстановитьТелоИзСтроки(PAPI_ОбработкаМетодов.ТелоИнфо(), КодировкаТекста.UTF8);		
		Возврат Ответ;
	КонецЕсли;	
	
	ТекстЗапроса = "Пришёл запрос: " + Символы.ПС;
	ТекстЗапроса = ТекстЗапроса + "ИмяМетода: " + Символы.Таб + Строка(ЗапросHTTP.ПараметрыURL["ИмяМетода"]) + Символы.ПС;
	ТекстЗапроса = ТекстЗапроса + "HTTPМетод: " + Символы.Таб + Строка(ЗапросHTTP.HTTPМетод) + Символы.ПС;
	ТекстЗапроса = ТекстЗапроса + "Тело: " + Символы.Таб + Строка(ЗапросHTTP.ПолучитьТелоКакСтроку("UTF-8")) + Символы.ПС;
	ТекстЗапроса = ТекстЗапроса + "ДатаЗапросаДанных: " + Символы.Таб + Строка(ТекущаяДата()) + Символы.ПС;
	
	ЗаписьЖурналаРегистрации("PAPI",,,,ТекстЗапроса);
	
	СтруктураВхПараметров = Новый Структура;
	СтруктураВхПараметров.Вставить("ИмяМетода", Строка(ЗапросHTTP.ПараметрыURL["ИмяМетода"]));
	СтруктураВхПараметров.Вставить("HTTPМетод", Строка(ЗапросHTTP.HTTPМетод));
	СтруктураВхПараметров.Вставить("Заголовки", ЗапросHTTP.Заголовки);  
	СтруктураВхПараметров.Вставить("ДатаЗапросаДанных", ТекущаяДата());
	
	Заголовки = ЗапросHTTP.Заголовки;
	ТипДанных = Заголовки.Получить("Content-Type");
	Если ТипДанных = Неопределено Тогда 
		Ответ = Новый HTTPСервисОтвет(405);
		Ответ.Заголовки.Вставить("Content-Type","text/html; charset=utf-8");
		Ответ.УстановитьТелоИзСтроки("Не установлен заголовок: Content-Type", КодировкаТекста.UTF8);		
		Возврат Ответ;
	КонецЕсли;	
	
	Если Не НРег(ТипДанных) = "application/json; charset=utf-8" Тогда
		Ответ = Новый HTTPСервисОтвет(405);
		Ответ.Заголовки.Вставить("Content-Type","text/html; charset=utf-8");
		Ответ.УстановитьТелоИзСтроки("В заголовоке Content-Type не указан: application/json; charset=utf-8", КодировкаТекста.UTF8);		
		Возврат Ответ;
	КонецЕсли;	
	
	СтрокаТело = Строка(ЗапросHTTP.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8));
	
	Если ПустаяСтрока(СокрЛП(СтрокаТело)) Тогда 
		СтруктураТело = "";
	Иначе 
		СтруктураТело = PAPI_ОбработкаМетодов.ПолучитьСтруктуруИлиМассивИзСтрокиJSON(СтрокаТело);
	КонецЕсли;	
	
	СтруктураВхПараметров.Вставить("Тело", СтруктураТело);
	СтруктураВхПараметров.Вставить("ТелоСтрока", СтрокаТело);
	
	ИнфоЗапрос = PAPI_ОбработкаМетодов.ВернутьСтруктуруИлиМассивКакСтрокуJSON(СтруктураВхПараметров);
	
	Если ИнфоЗапрос = Неопределено Тогда 	
		Ответ = Новый HTTPСервисОтвет(405);
		Ответ.Заголовки.Вставить("Content-Type","text/html; charset=utf-8");
		Ответ.УстановитьТелоИзСтроки("Ошибка обработки входных данных (см. журнал регистрации): " + СтруктураВхПараметров.СтрокаТело, КодировкаТекста.UTF8);		
		Возврат Ответ;		
	КонецЕсли;	
	
	СтруктураОтвет = PAPI_ОбработкаМетодов.ОбработкаМетодовHTTPСервис(СтруктураВхПараметров);
	
	Ответ = Новый HTTPСервисОтвет(СтруктураОтвет.КодОтвета);
	Ответ.Заголовки.Вставить("Content-Type","application/json; charset=utf-8");
	
	Если СтруктураОтвет.Отработало Тогда 
	    Ответ.УстановитьТелоИзСтроки(СтруктураОтвет.ДанныеОтвета, КодировкаТекста.UTF8);
	Иначе
		Ответ.УстановитьТелоИзСтроки(СтруктураОтвет.ТекстОшибки, КодировкаТекста.UTF8);
	КонецЕсли;
	
	
	
	Возврат Ответ;	
	
КонецФункции
